[
{
  "type": "tier",
  "tiers": [
    {
      "tier": "1",
      "name": "partial",
      "risks": [
        {
          "governance" : [
            "Application of the organizational cybersecurity risk strategy is managed in an ad hoc manner.",
            "Prioritization is ad hoc and not formally based on objectives or threat environment."
          ],
          "management" : [
            "There is limited awareness of cybersecurity risks at the organizational level.",
            "The organization implements cybersecurity risk management on an irregular, case-by-case basis.",
            "The organization may not have processes that enable cybersecurity information to be shared within the organization.",
            "The organization is generally unaware of the cybersecurity risks associated with its suppliers and the products and services it acquires and uses."
          ]
        }
      ]
    }
  ]
},
{
  "type": "profile",
  "name": "partial",
  "core" : [
    {
      "function" : "Protect",
      "short" : "PR",
      "categories" : [
        {
          "category" : "Platform Security",
          "short" : "PS",
          "description": "The hardware, software (e.g., firmware, operating systems, applications), and services of physical and virtual platforms are managed consistent with the organization’s risk strategy to protect their confidentiality, integrity, and availability",
          "subcategories" : [
            {
              "rule": "01",
              "description": "Configuration management practices are established and applied",
              "implementation": [
                "For Active Directory clients, in Azure the client is using Configuration Manager within Microsoft Intune."
              ],
              "outcomes" : {
                "current": {
                  "practices": [
                    "Policy: Configuration Management policy version 1.4, last updated 10/14/22. Defines the configuration change control policy [CM-1].",
                    "Procedures: System owners and technology managers informally implement configuration management practices. Change control processes are not consistently followed. The CIO specifies configuration baselines [CM-2] for the IT platforms and applications most widely used within the organization, but baseline use is not monitored or enforced consistently across the organization."
                  ],
                  "status" : [
                    "Configuration management is partially implemented within the organization. Some systems do not follow available baselines and other systems do not have baselines, so they may have weak configurations that make them more susceptible to misuse and compromise. Unauthorized changes may go undetected. Some changes are not tested or tracked."
                  ],
                  "rating" : 3.0
                },
                "target": {
                  "priority": "high",
                  "goals": [
                    "Policy: The Configuration Management policy requires configuration baselines to be specified, used, enforced, and maintained for all commodity technologies used by the organization. The policy requires change control processes to be followed for all technologies within the organization [CM-1].",
                    "Procedures: Each division of the organization has a configuration management plan [CM-9], as well as maintains, implements, and enforces configuration baselines [CM-2] and settings [CM-6] for their systems. Baselines are applied to all systems before production release. All systems are continuously monitored for unexpected configuration changes, and tickets are automatically generated when deviations from baselines occur. Designated parties review change requests and corresponding impact analyses [CM-4] and approve or deny each [CM-3]."
                  ]
                }
              }
            }
          ]
        }
      ]
    }
  ]
}
]